{
  "dungeon_map": {
    "home": {
      "name": "Gerbang Masuk Dungeon",
      "description": "Sebuah pintu besi tua berderit saat kamu melewatinya. Cahaya obor di dinding berkedip lemah, menerangi tulisan kuno yang tergores di batu: 'Masuk dan lupakan harapan.' Bau lembab dan tanah basah memenuhi hidungmu.",
      "exits": {
        "kiri": "a",
        "kanan": "b"
      },
      "items": ["obor_redup", "catatan_penjaga"]
    },
    "a": {
      "name": "Aula Prajurit Gugur",
      "description": "Ruangan besar dengan empat pintu. Kerangka prajurit dalam baju zirah berkarat tersandar di dinding, seolah masih berjaga. Di tengah ruangan terdapat meja batu dengan peta dungeon yang sudah memudar.",
      "exits": {
        "kembali": "home",
        "utara": "b",
        "selatan": "boss",
        "bawah": "t"
      },
      "items": ["peta_usang", "zirah_retak"]
    },
    "b": {
      "name": "Ruang Perpustakaan Terlarang",
      "description": "Rak-rak kayu tinggi memenuhi ruangan ini, penuh buku dengan sampul kulit hitam. Beberapa buku tampak bergetar sendiri. Sebuah meja membaca di pojok masih menyisakan lilin yang hampir habis meleleh.",
      "exits": {
        "kembali": "home",
        "barat": "a",
        "bawah": "boss"
      },
      "items": ["buku_mantra_dasar", "lilin_ajaib"]
    },
    "boss": {
      "name": "Singgasana Sang Penjaga",
      "description": "Ruangan megah dengan langit-langit tinggi yang hilang dalam kegelapan. Di tengah berdiri singgasana batu obsidian, kosong — namun tanda cakar raksasa di lantai menunjukkan sesuatu yang besar pernah duduk di sini. Lima pintu berbeda mengelilingi ruangan ini.",
      "exits": {
        "utara": "a",
        "timur-laut": "b",
        "barat": "c",
        "timur": "d",
        "bawah": "t"
      },
      "items": ["kunci_obsidian", "fragmen_mahkota", "darah_penjaga"]
    },
    "c": {
      "name": "Penjara Bawah Tanah",
      "description": "Sel-sel besi berkarat berjajar sepanjang koridor sempit. Di salah satu sel, terdapat ukiran tanda hitungan di dinding — seseorang pernah terkurung sangat lama di sini. Bau busuk dan suara tetesan air memenuhi ruangan.",
      "exits": {
        "timur": "boss",
        "bawah": "t"
      },
      "items": ["kunci_sel_berkarat", "tulang_tahanan"]
    },
    "d": {
      "name": "Gudang Senjata Terlupakan",
      "description": "Rak senjata penuh pedang patah, perisai berlubang, dan tombak tanpa ujung. Namun di sudut terjauh, sebuah peti besi kecil bertanda segel merah tampak utuh dan belum disentuh.",
      "exits": {
        "bawah": "t"
      },
      "items": ["pedang_patah", "peti_tersegel"]
    },
    "t": {
      "name": "Ruang Inti Kegelapan",
      "description": "Ruangan paling dalam dan paling gelap. Lantai dari kristal hitam memantulkan bayangan yang salah — bayanganmu bergerak sedikit lebih lambat dari tubuhmu. Di tengah ruangan terdapat altar batu dengan sebuah kristal merah berdenyut pelan, memancarkan cahaya seperti detak jantung.",
      "exits": {
        "atas-barat": "boss",
        "utara": "c",
        "utara-timur": "d",
        "atas-timur": "a"
      },
      "items": ["kristal_inti", "cermin_kegelapan", "jejak_kuno"]
    }
  }
}